---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.ShowTitle
source: html/a8e127d5-7dbd-bf97-f3ab-b3641316b321.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.ShowTitle Property

Indicates if the title will be displayed in the schedule.

## Syntax (C#)
```csharp
public bool ShowTitle { get; set; }
```